Synwit-Co-Ltd/SWM241_Lib/EXTI/SimplEXTI_Multi/APP/main.c
#include "SWM241.h"

void SerialInit(void);

int main(void)
{	
	SystemInit();
	
	SerialInit();
	
	GPIO_Init(GPIOA, PIN5, 1, 0, 0, 0);			//输出，接LED
	
	GPIO_Init(GPIOC, PIN0, 0, 1, 0, 0);
	EXTI_Init(GPIOC, PIN0, EXTI_FALL_EDGE);
	EXTI_Open(GPIOC, PIN0);
	
	GPIO_Init(GPIOC, PIN1, 0, 1, 0, 0);
	EXTI_Init(GPIOC, PIN1, EXTI_FALL_EDGE);
	EXTI_Open(GPIOC, PIN1);
	
	GPIO_Init(GPIOC, PIN2, 0, 1, 0, 0);
	EXTI_Init(GPIOC, PIN2, EXTI_FALL_EDGE);
	EXTI_Open(GPIOC, PIN2);
	
	NVIC_EnableIRQ(PWM3_GPIOC_SAFETY_IRQn);
	
	while(1==1)
	{
	}
}

void PWM3_GPIOC_SAFETY_Handler(void)
{
	if(EXTI_State(GPIOC, PIN0))
	{
		EXTI_Clear(GPIOC, PIN0);
		
		GPIO_InvBit(GPIOA, PIN5);
	}
	else if(EXTI_State(GPIOC, PIN1))
	{
		EXTI_Clear(GPIOC, PIN1);
		
		GPIO_InvBit(GPIOA, PIN5);
	}
	else if(EXTI_State(GPIOC, PIN2))
	{
		EXTI_Clear(GPIOC, PIN2);
		
		GPIO_InvBit(GPIOA, PIN5);
	}
	else 
	{
		printf("Error!\r\n");
	}
}


void SerialInit(void)
{
	UART_InitStructure UART_initStruct;
	
	PORT_Init(PORTD, PIN13, PORTD_PIN13_UART0_RX, 1);	//GPIOD.13配置为UART0输入引脚
	PORT_Init(PORTD, PIN14, PORTD_PIN14_UART0_TX, 0);	//GPIOD.14配置为UART0输出引脚
 	
	UART_initStruct.Baudrate = 57600;
	UART_initStruct.DataBits = UART_DATA_8BIT;
	UART_initStruct.Parity = UART_PARITY_NONE;
	UART_initStruct.StopBits = UART_STOP_1BIT;
	UART_initStruct.RXThresholdIEn = 0;
	UART_initStruct.TXThresholdIEn = 0;
	UART_initStruct.TimeoutIEn = 0;
 	UART_Init(UART0, &UART_initStruct);
	
	UART_Open(UART0);
}

/****************************************************************************************************************************************** 
* 函数名称: fputc()
* 功能说明: printf()使用此函数完成实际的串口打印动作
* 输    入: int ch		要打印的字符
*			FILE *f		文件句柄
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
int fputc(int ch, FILE *f)
{
	UART_WriteByte(UART0, ch);
	
	while(UART_IsTXBusy(UART0));
 	
	return ch;
}
